/*
 * @name: 文件
 * @Author: Haojin Sun
 * @Date: 2020-03-02 17:35:42
 * @LastEditors: Haojin Sun
 * @LastEditTime: 2020-03-02 17:44:11
 */
let a = `[{"id":"0001","pId":null,"name":"测绘"},{"id":"00010002","pId":"0001","name":"工程测量专业标准"},{"id":"0001000200040008","pId":"00010002","name":"变形形变与精密测量"},{"id":"0001000200040009","pId":"00010002","name":"市政工程测量"},{"id":"0001000200040011","pId":"00010002","name":"线路与桥隧测量"},{"id":"0001000200040012","pId":"00010002","name":"地下管线测量"},{"id":"0001000200040007","pId":"00010002","name":"建筑工程测量"},{"id":"0001000200040006","pId":"00010002","name":"规划测量"},{"id":"0001000200040005","pId":"00010002","name":"地形测量"},{"id":"0001000200040010","pId":"00010002","name":"水利工程测量"},{"id":"000100020004","pId":"00010002","name":"控制测量"},{"id":"00010003","pId":"0001","name":"不动产测绘专业标准"},{"id":"000100030013","pId":"00010003","name":"地籍绘测"},{"id":"000100030014","pId":"00010003","name":"房产绘测"}]`

let b = JSON.parse(a)
console.log(b)
console.log(Array.isArray(b))